STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_MultiAppAt/STM32_WPAN/App/app_ble_hr.c
};
/* USER CODE BEGIN PV */

HRS_APP_ConnHandle_Not_evt_t handleNotificationHR;

APP_BLE_ConnStatus_t HR_Connection_Status;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void BLE_UserEvtRx( void * pPayload );
static void BLE_StatusNot( HCI_TL_CmdStatus_t status );
static void Ble_Tl_Init( void );
static void Ble_Hci_Gap_Gatt_Init(void);
static const uint8_t* BleGetBdAddress( void );
static void Adv_Request( APP_BLE_ConnStatus_t New_Status );
//static void Add_Advertisment_Service_UUID( uint16_t servUUID );
static void Adv_Mgr( void );
static void Adv_Update( void );

/* USER CODE BEGIN PFP */

static void APP_BLE_HR_GAP_Disconnect( void);
static void Confirm_Pairing( void );
static void Pairing_Request ( void );

/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
void APP_BLE_HR_Init( void )
{
/* USER CODE BEGIN APP_BLE_Init_1 */

/* USER CODE END APP_BLE_Init_1 */
  SHCI_C2_Ble_Init_Cmd_Packet_t ble_init_cmd_packet =
  {
    {{0,0,0}},                          /**< Header unused */
    {0,                                 /** pBleBufferAddress not used */
    0,                                  /** BleBufferSize not used */
    CFG_BLE_NUM_GATT_ATTRIBUTES,
    CFG_BLE_NUM_GATT_SERVICES,
    CFG_BLE_ATT_VALUE_ARRAY_SIZE,
    CFG_BLE_NUM_LINK,
    CFG_BLE_DATA_LENGTH_EXTENSION,
    CFG_BLE_PREPARE_WRITE_LIST_SIZE,
    CFG_BLE_MBLOCK_COUNT,
    CFG_BLE_MAX_ATT_MTU,
    CFG_BLE_SLAVE_SCA,
    CFG_BLE_MASTER_SCA,
    CFG_BLE_LSE_SOURCE,
    CFG_BLE_MAX_CONN_EVENT_LENGTH,
    CFG_BLE_HSE_STARTUP_TIME,
    CFG_BLE_VITERBI_MODE,
    CFG_BLE_OPTIONS,
    0,
    CFG_BLE_MAX_COC_INITIATOR_NBR,
    CFG_BLE_MIN_TX_POWER,
    CFG_BLE_MAX_TX_POWER}
  };

  /**
   * Initialize Ble Transport Layer
   */
  Ble_Tl_Init( );

  /**
   * Do not allow standby in the application
   */
  UTIL_LPM_SetOffMode(1 << CFG_LPM_APP_BLE, UTIL_LPM_DISABLE);

  /**
   * Register the hci transport layer to handle BLE User Asynchronous Events
   */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_HCI_ASYNCH_EVT_ID, UTIL_SEQ_RFU, hci_user_evt_proc);

  /**
   * Starts the BLE Stack on CPU2
   */
  SHCI_C2_BLE_Init( &ble_init_cmd_packet );

  /**
   * Initialization of HCI & GATT & GAP layer
   */
  Ble_Hci_Gap_Gatt_Init();

  /**
   * Initialization of the BLE Services
   */
  SVCCTL_Init();

  /**
   * Initialization of the BLE App Context
   */
  BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
  HR_Connection_Status = APP_BLE_IDLE;
  BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0xFFFF;  
  /**
   * From here, all initialization are BLE application specific
   */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_ADV_UPDATE_ID, UTIL_SEQ_RFU, Adv_Update);
  UTIL_SEQ_RegTask( 1<<CFG_TASK_HR_GAP_DISCON_ID, UTIL_SEQ_RFU, APP_BLE_HR_GAP_Disconnect);
  UTIL_SEQ_RegTask( 1<<CFG_TASK_CONFIRM_PAIRING_ID, UTIL_SEQ_RFU, Confirm_Pairing);
  UTIL_SEQ_RegTask( 1<<CFG_TASK_REQUEST_PAIRING_ID, UTIL_SEQ_RFU, Pairing_Request);
  /**
   * Initialization of ADV - Ad Manufacturer Element
   */
  
  /**
   * Initialize DIS Application
   */
  DISAPP_Init();

  /**
   * Initialize HRS Application
   */
  HRSAPP_Init();

  /**
   * Create timer to handle the connection state machine
   */

  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(BleApplicationContext.Advertising_mgr_timer_Id), hw_ts_SingleShot, Adv_Mgr);

  /**
   * Make device discoverable
   */
  BleApplicationContext.BleApplicationContext_legacy.advtServUUID[0] = NULL;//AD_TYPE_16_BIT_SERV_UUID;
  BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen = 0;//1;
//  Add_Advertisment_Service_UUID(HEART_RATE_SERVICE_UUID);
  /* Initialize intervals for reconnexion without intervals update */
  AdvIntervalMin = CFG_FAST_CONN_ADV_INTERVAL_MIN;
  AdvIntervalMax = CFG_FAST_CONN_ADV_INTERVAL_MAX;

  /**
  * Start to Advertise to be connected by Collector
   */
   Adv_Request(APP_BLE_FAST_ADV);

/* USER CODE BEGIN APP_BLE_Init_2 */  
   
   /**
   * Send a acknowledgement of the correct initialization of the p2p application
   */
   UART_App_SendData("\r\nHR OK\r\n", 9);
   

/* USER CODE END APP_BLE_Init_2 */
  return;
}

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_HR_Notification( void *pckt )
{
  hci_event_pckt *event_pckt;
  evt_le_meta_event *meta_evt;
  evt_blecore_aci *blecore_evt;
  /* Pairing */
  aci_gap_numeric_comparison_value_event_rp0 *evt_numeric_value;
  aci_gap_pairing_complete_event_rp0 *pairing_complete;
  uint32_t numeric_value;
  char numeric_value_str[20];
  /*****/

  event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) pckt)->data;

  switch (event_pckt->evt)
  {
    case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
    {
      hci_disconnection_complete_event_rp0 *disconnection_complete_event;
      disconnection_complete_event = (hci_disconnection_complete_event_rp0 *) event_pckt->data;

      if (disconnection_complete_event->Connection_Handle == BleApplicationContext.BleApplicationContext_legacy.connectionHandle)
      {
        BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0;
        BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
        HR_Connection_Status = APP_BLE_IDLE;
#if(CFG_DEBUG_APP_TRACE != 0)
        APP_DBG_MSG("\r\n\r** DISCONNECTION EVENT WITH CLIENT \n");
#endif        
      }
      
      if (disconnection_status == TO_SWITCH_APP) //Disconnection done by application for switching app
      {
        handleNotificationHR.HR_Evt_Opcode = HR_DISCON_SWITCH_HANDLE_EVT;
        handleNotificationHR.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
        HRS_APP_Notification(&handleNotificationHR);
      }
      else { //Deconnection done by user/client
        PairingContext.PairingComplete = 0; //The pairing is reset to allow the user to perform a pairing on next connection
        
        handleNotificationHR.HR_Evt_Opcode = HR_DISCON_HANDLE_EVT;
        handleNotificationHR.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
        HRS_APP_Notification(&handleNotificationHR);
        /* restart advertising */
        Adv_Request(APP_BLE_FAST_ADV);
      }
}

    break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */

    case HCI_LE_META_EVT_CODE:
    {
      meta_evt = (evt_le_meta_event*) event_pckt->data;
      /* USER CODE BEGIN HCI_LE_META_EVT_CODE */

      /* USER CODE END HCI_LE_META_EVT_CODE */
      switch (meta_evt->subevent)
      {
        case HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE: 
#if(CFG_DEBUG_APP_TRACE != 0)
          APP_DBG_MSG("\r\n\r** CONNECTION UPDATE EVENT WITH CLIENT \n");
#endif
          /* USER CODE BEGIN HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE */

          /* USER CODE END HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE */
          break;
        case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
          {
          hci_le_connection_complete_event_rp0 *connection_complete_event;

          /**
           * The connection is done, there is no need anymore to schedule the LP ADV
           */
          connection_complete_event = (hci_le_connection_complete_event_rp0 *) meta_evt->data;
          
