STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_MultiAppAt/STM32_WPAN/App/app_ble_hr.c
          HW_TS_Stop(BleApplicationContext.Advertising_mgr_timer_Id);

#if(CFG_DEBUG_APP_TRACE != 0)
          APP_DBG_MSG("HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE for connection handle 0x%x\n",
          connection_complete_event->Connection_Handle);
#endif
            if (BleApplicationContext.Device_Connection_Status == APP_BLE_LP_CONNECTING)
            {
              /* Connection as client */
              BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;
              HR_Connection_Status = APP_BLE_CONNECTED_CLIENT;
            }
            else
            {
              /* Connection as server */
              BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_SERVER;
              HR_Connection_Status = APP_BLE_CONNECTED_SERVER;
            }
            BleApplicationContext.BleApplicationContext_legacy.connectionHandle =
                connection_complete_event->Connection_Handle;
          /* USER CODE BEGIN HCI_HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */
            
            handleNotificationHR.HR_Evt_Opcode = HR_CONN_HANDLE_EVT;
            handleNotificationHR.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
            HRS_APP_Notification(&handleNotificationHR);

          /* USER CODE END HCI_HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */
          }
        break; /* HCI_HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */

        default:
          /* USER CODE BEGIN SUBEVENT_DEFAULT */

          /* USER CODE END SUBEVENT_DEFAULT */
          break;
      }
    }
    break; /* HCI_HCI_LE_META_EVT_CODE */

    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
      blecore_evt = (evt_blecore_aci*) event_pckt->data;
      /* USER CODE BEGIN HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */

      /* USER CODE END HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */
      switch (blecore_evt->ecode)
      {
      /* USER CODE BEGIN ecode */

      /* USER CODE END ecode */
        case ACI_GAP_PROC_COMPLETE_VSEVT_CODE:
#if(CFG_DEBUG_APP_TRACE != 0)
        APP_DBG_MSG("\r\n\r** ACI_GAP_PROC_COMPLETE_VSEVT_CODE \n");
#endif
        /* USER CODE BEGIN ACI_GAP_PROC_COMPLETE_VSEVT_CODE */

        /* USER CODE END ACI_GAP_PROC_COMPLETE_VSEVT_CODE */
        break; /* ACI_GAP_PROC_COMPLETE_VSEVT_CODE */
        
        /* Pairing */
        case ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE:
            UART_App_SendData("\r\n", 2);
            PairingContext.PairingConfirmRequested = 1;
            evt_numeric_value = (aci_gap_numeric_comparison_value_event_rp0 *)blecore_evt->data;
            numeric_value = evt_numeric_value->Numeric_Value;
            sprintf(numeric_value_str, "%d", (int)numeric_value);
            UART_App_SendData((char *)numeric_value_str, (uint8_t)(strlen(numeric_value_str)));
            UART_App_SendData(":PREQ?\r\n", 8);
//            APP_DBG_MSG("numeric_value = %x\n", numeric_value);
//            aci_gap_numeric_comparison_value_confirm_yesno(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,0x01);
        break;
        
        case ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE: //aci_gap_pairing_complete_event_process
            pairing_complete = (aci_gap_pairing_complete_event_rp0*)blecore_evt->data;
//            APP_DBG_MSG("BLE_CTRL_App_Notification: ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE, pairing_complete->Status = %d\n",pairing_complete->Status);
            if (pairing_complete->Status == 0)
            {
              UART_App_SendData("\r\nP\r\n", 5);
              PairingContext.PairingComplete = 1;
            }
            else UART_App_SendData("\r\nF\r\n", 5);
        break;
      }
      break; /* HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */

        default:
        /* USER CODE BEGIN ECODE_DEFAULT*/

        /* USER CODE END ECODE_DEFAULT*/
          break;
  }

  return (SVCCTL_UserEvtFlowEnable);
}

APP_BLE_ConnStatus_t APP_BLE_HR_Get_Server_Connection_Status(void)
{
    return BleApplicationContext.Device_Connection_Status;
}

/**
 * @brief  Disconnect the Link before switching to another BLE Application
 * @param  None
 * @retval None
 */
static void APP_BLE_HR_GAP_Disconnect(){
    tBleStatus result;
    result = aci_gap_terminate(BleApplicationContext.BleApplicationContext_legacy.connectionHandle, ERR_RMT_USR_TERM_CONN);
    
    if (result == BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG(" \r\n\r** TERMINATE CONNECTION **  \r\n\r");
    }
    else
    {
      APP_DBG_MSG("-- APP_BLE_HR_GAP_Disconnect, Failed \r\n\r");
      BSP_LED_On(LED_RED);
    }
  return;
}

/* USER CODE BEGIN FD*/
void APP_BLE_HR_Key_Button1_Action(void)
{

}

void APP_BLE_HR_Key_Button2_Action(void)
{
  
}

void APP_BLE_HR_Key_Button3_Action(void)
{
}

/* USER CODE END FD*/
/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
static void Ble_Tl_Init( void )
{
  HCI_TL_HciInitConf_t Hci_Tl_Init_Conf;

  Hci_Tl_Init_Conf.p_cmdbuffer = (uint8_t*)&BleCmdBuffer;
  Hci_Tl_Init_Conf.StatusNotCallBack = BLE_StatusNot;
  hci_init(BLE_UserEvtRx, (void*) &Hci_Tl_Init_Conf);

  return;
}

 static void Ble_Hci_Gap_Gatt_Init(void){

  uint8_t role;
  uint16_t gap_service_handle, gap_dev_name_char_handle, gap_appearance_char_handle;
  const uint8_t *bd_addr;
  uint32_t srd_bd_addr[2];
  uint16_t appearance[1] = { BLE_CFG_GAP_APPEARANCE }; 

  /**
   * Initialize HCI layer
   */
  /*HCI Reset to synchronise BLE Stack*/
  hci_reset();

  /**
   * Write the BD Address
   */

  bd_addr = BleGetBdAddress();
  aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET,
                            CONFIG_DATA_PUBADDR_LEN,
                            (uint8_t*) bd_addr);

  /* BLE MAC in ADV Packet */
  manuf_data_hr[ sizeof(manuf_data_hr)-6] = bd_addr[5];
  manuf_data_hr[ sizeof(manuf_data_hr)-5] = bd_addr[4];
  manuf_data_hr[ sizeof(manuf_data_hr)-4] = bd_addr[3];
  manuf_data_hr[ sizeof(manuf_data_hr)-3] = bd_addr[2];
  manuf_data_hr[ sizeof(manuf_data_hr)-2] = bd_addr[1];
  manuf_data_hr[ sizeof(manuf_data_hr)-1] = bd_addr[0];
  
  /**
   * Write Identity root key used to derive LTK and CSRK 
   */
    aci_hal_write_config_data(CONFIG_DATA_IR_OFFSET,
    CONFIG_DATA_IR_LEN,
                            (uint8_t*) BLE_CFG_IR_VALUE);
    
   /**
   * Write Encryption root key used to derive LTK and CSRK
   */
    aci_hal_write_config_data(CONFIG_DATA_ER_OFFSET,
    CONFIG_DATA_ER_LEN,
                            (uint8_t*) BLE_CFG_ER_VALUE);

   /**
   * Write random bd_address
   */
   /* random_bd_address = R_bd_address;
    aci_hal_write_config_data(CONFIG_DATA_RANDOM_ADDRESS_WR,
    CONFIG_DATA_RANDOM_ADDRESS_LEN,
                            (uint8_t*) random_bd_address);
  */

  /**
   * Static random Address
   * The two upper bits shall be set to 1
   * The lowest 32bits is read from the UDN to differentiate between devices
   * The RNG may be used to provide a random number on each power on
   */
  srd_bd_addr[1] =  0x0000ED6E;
  srd_bd_addr[0] =  LL_FLASH_GetUDN( );
  aci_hal_write_config_data( CONFIG_DATA_RANDOM_ADDRESS_OFFSET, CONFIG_DATA_RANDOM_ADDRESS_LEN, (uint8_t*)srd_bd_addr );

  /**
   * Write Identity root key used to derive LTK and CSRK 
   */
    aci_hal_write_config_data( CONFIG_DATA_IR_OFFSET, CONFIG_DATA_IR_LEN, (uint8_t*)BLE_CFG_IR_VALUE );
    
   /**
   * Write Encryption root key used to derive LTK and CSRK
   */
    aci_hal_write_config_data( CONFIG_DATA_ER_OFFSET, CONFIG_DATA_ER_LEN, (uint8_t*)BLE_CFG_ER_VALUE );

  /**
   * Set TX Power to 0dBm.
   */
  aci_hal_set_tx_power_level(1, CFG_TX_POWER);

  /**
   * Initialize GATT interface
   */
  aci_gatt_init();

  /**
   * Initialize GAP interface
   */
  role = 0;

